import pandas as pd
print(pd.__version__)   # 1.3.4

data = [
    ["삼성", "1000", "2000"],
    ["현대", "1100", "3000"],
    ["LG", "2000", "500"],
    ["아모레", "3500", "6000"],
    ["네이버", "100", "1500"],
]

index = ['031', '059', '033', '045', '023']
columns = ['종목명', '시가', '종가']

df = pd.DataFrame(data=data, index=index, columns=columns)

# print(df)
'''
     종목명    시가    종가
031   삼성  1000  2000
059   현대  1100  3000
033   LG  2000   500
045  아모레  3500  6000
023  네이버   100  1500
'''

print("========== 시가가 1100원 이상인 행을 모두 출력 ==========")
aaa = df['시가'] >= '1100'
print(aaa)
'''
031    False
059     True
033     True
045     True
023    False
'''
print(df[aaa])
'''
     종목명    시가    종가
059   현대  1100  3000
033   LG  2000   500
045  아모레  3500  6000
'''
print(df.loc[aaa])
'''
     종목명    시가    종가
059   현대  1100  3000
033   LG  2000   500
045  아모레  3500  6000
'''
# print(df.iloc[aaa])   # ValueError: iLocation based boolean indexing cannot use an indexable as a mask

print("========== 1100원 이상인 것만 뽑아서 새로 df2를 만들기 ==========")
# 이 방식을 가장 많이 사용한다.
df2 = pd.DataFrame()
df2 = df[df['시가'] >= '1100']
print(df2)
'''
     종목명    시가    종가
059   현대  1100  3000
033   LG  2000   500
045  아모레  3500  6000
'''

# 위에서 '종가' 컬럼만 뽑고 싶다.
# print(df2['종가'])
'''
059    3000
033     500
045    6000
'''
df3 = df[df['시가'] >= '1100']['종가']
print(df3)
'''
059    3000
033     500
045    6000
'''

df4 = df.loc[df['시가'] >= '1100']['종가']
print(df4)  # loc는 똑같다.
'''
059    3000
033     500
045    6000
'''

##################################################
# df5 = df[df['시가'] >= '1100', '종가']
# print(df5)      # TypeError: '(031    False

df6 = df.loc[df['시가'] >= '1100', '종가']
print(df6)
'''
059    3000
033     500
045    6000
'''
