import pandas as pd
print(pd.__version__)   # 1.3.4

data = [
    ["삼성", "1000", "2000"],
    ["현대", "1100", "3000"],
    ["LG", "2000", "500"],
    ["아모레", "3500", "6000"],
    ["네이버", "100", "1500"],
]

index = ['031', '059', '033', '045', '023']
columns = ['종목명', '시가', '종가']

df = pd.DataFrame(data=data, index=index, columns=columns)

# print(df)
'''
     종목명    시가    종가
031   삼성  1000  2000
059   현대  1100  3000
033   LG  2000   500
045  아모레  3500  6000
023  네이버   100  1500
'''

print("=============== iloc ===============")
########## 아모레와 네이버의 시가 (범위) ##########
print(df.iloc[3:5, 1])              # 행, 렬
print(df.iloc[3:, 1]) 
# 045    3500
# 023     100
# print(df.iloc[3:, '시가'])        # ValueError

########## LG와 네이버의 시가 (특정 행만 지정) ##########
print(df.iloc[[2,4], 1]) 
# 033    2000
# 023     100
# print(df.iloc[[2,4], '시가'])     # ValueError

print("=============== loc ===============")
########## 아모레와 네이버의 시가 (범위) ##########
print(df.loc['045':'023', '시가'])  # 행, 렬
print(df.loc['045':, '시가'])
# 045    3500
# 023     100
# print(df.loc['045':, 1])          # KeyError: 1

########## LG와 네이버의 시가 (특정 행만 지정) ##########
print(df.loc[['033', '023'], '시가'])
# 033    2000
# 023     100
# print(df.loc[['033', '023'], 1])  # KeyError: 1

print("=============== loc, iloc 혼용 ===============")
print(df.loc['033'].iloc[2])
# 500
print(df.loc['033':'023'].iloc[2])
# 종목명     네이버
# 시가      100
# 종가     1500

print(df.iloc[2].loc['시가'])
# 2000
print(df.iloc[2:3].loc['시가'])
# KeyError: '시가'

print("=============== 나중에 다시 해보기 ===============")
# print(df.iloc[1:4].iloc[1:4])
# 행 뽑고 그 뽑은 행에서 또 행 뽑기
# ...
